{
    "Experiences": [
      {
        "place": "Relativity Space",
        "position": "Software Engineer Intern",
        "duration": "Nov 2022 – Present",
        "description": "In May 2024, I joined Relativity Space as a Software Engineer Intern, bringing with me a wealth of experience from my previous roles at NASA Jet Propulsion Lab and Columbia University's Computer Science Department. At Relativity Space, we have set two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. These objectives are part of our long-term vision to create humanity’s industrial base on Mars, paving the way for interplanetary life and expanding the possibilities of the human experience. This journey begins on Earth, where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity through an iterative approach that accelerates design, testing, and development while minimizing costs. Our groundbreaking research and development in 3D printing push the boundaries of large-scale additive manufacturing.\n\nJoining Relativity Space is more than just a job; it's an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate and creative individuals. As part of the Mission Assurance and Vehicle Simulation (MAVS) Software team, I work with top talent from diverse industries, including leading companies such as SpaceX, Google, and Amazon. In this role, I play a key part in designing and building systems to configure and test our Terran-R rocket, supporting stakeholders including Avionics, Guidance Navigation and Control, Propulsion, Test, and Launch Operations. The MAVS team is at the forefront of driving Relativity Space towards our mission of a multiplanetary future, from changing how we manufacture rockets to how we fly them.\n\nIn my current role, I am involved in driving the design and development of our team’s software, which includes hardware-in-the-loop and software-in-the-loop test software infrastructure, vehicle proxy, vehicle configuration, and vehicle software deployment. My previous experience in developing a robust Python-based backend application at NASA JPL has been invaluable in understanding the complexities of large-scale data management and retrieval. Leveraging AWS tools and utilizing Amazon S3 for seamless data storage and management, I am well-equipped to handle the extensive data requirements at Relativity Space.\n\nAdditionally, my work at NASA JPL on data visualization has prepared me to implement sophisticated features that generate meaningful insights from complex datasets. Using MatPlotLib and NumPy libraries, I created visualizations that were both accurate and user-friendly, a skill that is crucial for supporting our scientific community at Relativity Space. My experience in containerization strategies, where I designed and implemented solutions to manage large-scale data processing without overloading servers, aligns perfectly with the needs at Relativity Space, where efficiency and reliability are paramount.\n\nAt Columbia University, my role as a Teaching Assistant for Advanced Programming in C involved mentoring over 800 students and developing automated grading scripts that optimized the grading process by 75%. This experience honed my ability to communicate complex technical concepts and provided me with valuable insights into process automation and efficiency improvements. These skills are directly applicable to my current role, where I am focused on refining software requirements with stakeholders, advocating best practices for unit and system integration tests in CI/CD, and mentoring fellow engineers to maximize our team's velocity.\n\nWorking at Relativity Space has been an incredibly rewarding experience, providing me with the opportunity to apply my technical skills in a cutting-edge environment and contribute to pioneering advancements in aerospace technology. The knowledge and experience I bring from my previous roles have laid a strong foundation for my contributions at Relativity Space, as we work together to transform our vision into reality and pave the way for humanity’s future on Mars.",
        "image": null
      },
      {
        "place": "NASA Jet Propulsion Lab",
        "position": "Full-Year Software Engineer Intern",
        "duration": "Nov 2022 – Present",
        "description": "In November 2022, I joined the NASA Jet Propulsion Lab as a Full-Year Software Engineer Intern. This opportunity allowed me to dive into the fascinating world of space exploration and contribute to critical backend development projects. My primary responsibility was to develop a robust Python-based backend application aimed at optimizing the retrieval of extensive datasets from NASA databases. Leveraging AWS tools, I was able to efficiently handle large volumes of data, utilizing Amazon S3 for seamless data storage and management.\n\nEarly in my tenure, I identified the need for enhanced data visualization capabilities to better support the scientific community. To address this, I implemented a sophisticated data visualization feature that generated mask files and plots based on user-requested variables and data. Using MatPlotLib and NumPy libraries, I ensured that the visualizations were not only accurate but also user-friendly, enabling researchers to draw meaningful insights from their data.\n\nA significant challenge I encountered was the need to manage and process large datasets without overloading our servers. To mitigate this, I designed and implemented containerization strategies that allowed for the efficient handling of large jobs. By utilizing Docker, I was able to reduce server load and ensure that our systems remained responsive and reliable even under heavy data processing demands.\n\nMy role at NASA JPL wasn't confined to technical development alone. I actively participated in cross-functional meetings, collaborating with scientists, engineers, and other stakeholders to understand their requirements and translate them into technical solutions. This experience honed my ability to communicate complex technical concepts to non-technical audiences and ensured that the solutions I developed were aligned with the broader mission objectives.\n\nWorking at NASA JPL has been an incredibly rewarding experience, providing me with a unique perspective on the intersection of technology and space exploration. It has also equipped me with valuable skills in backend development, data visualization, and containerization, all of which are crucial for handling large-scale scientific data. The knowledge and experience I gained here have laid a strong foundation for my future endeavors in software engineering and beyond.",
        "image": null
      },
      {
        "place": "Columbia University CS Dept.",
        "position": "Teaching Assistant for Advanced Programming in C",
        "duration": "Aug 2022 – May 2023",
        "description": "In August 2022, I embarked on a rewarding journey as a Teaching Assistant for     Advanced Programming in C at Columbia University's Computer Science Department. This role provided me with the unique opportunity to support and mentor over 800 students in their programming endeavors. My responsibilities were extensive, encompassing assistance with programming languages such as C, BASH, and UNIX, as well as TCP/IP networking. I offered this support through multiple channels, including email consultations, weekly office hours, and leading two comprehensive review sessions. These interactions allowed me to provide personalized guidance, helping students overcome their challenges and deepening their understanding of complex programming concepts. Early on, I recognized the need for practical and accessible learning resources to enhance student proficiency. To address this, I collaborated closely with instructors and course staff to develop a series of comprehensive guides. These guides, which were made available on GitHub, covered essential topics such as effective Vim use and SSH-key generation practices. This collaborative effort resulted in a significant increase in student proficiency, with a noted 40% improvement in key technical skills. By providing these resources, we ensured that students had the necessary tools to succeed in their coursework and future careers. A significant challenge I encountered was the manual and time-consuming grading process for a large number of code submissions. To streamline this process and enhance efficiency, I developed an automated Python grading script. This script was designed to handle the grading of approximately 400 code submissions, optimizing the process by about 75%. The automation not only sped up the grading process but also significantly increased grade accuracy and consistency. This innovation ensured that students received timely and fair assessments, allowing them to focus on learning and improvement. My role as a Teaching Assistant wasn't confined to technical support alone. I actively participated in the development of the course curriculum and worked closely with instructors to ensure that the course content was aligned with the latest industry standards. This experience honed my ability to communicate complex technical concepts to a diverse group of students, ensuring that the solutions I provided were both effective and comprehensible. Working as a Teaching Assistant at Columbia University has been an incredibly rewarding experience, providing me with a unique perspective on the intersection of education and technology. It has also equipped me with valuable skills in technical support, resource development, and process automation, all of which are crucial for handling large-scale educational tasks. The knowledge and experience I gained here have laid a strong foundation for my future endeavors in software engineering and beyond.",
        "image": null
      }
    ]
  }
  